Repository: WPPlugins/import-youtube-videos-as-wp-post
Catalog: i18n/youtube-to-posts-*.po
Languages: fr_fr

source: Media added !
fr_fr: Vidéo ajoutée !

source: Youtube query options
fr_fr: Options de requête vers Youtube

source: Query:
fr_fr: Requête :

source: Max results?
fr_fr: Nombre de résultats maximum&nbsp;?

source: Default value is 30
fr_fr: La valeur par défaut est de 30

source: Post type to feed:
fr_fr: Type de post à alimenter :

source: Results from Youtube for:
fr_fr: Résultats récupérés depuis Youtube pour la requête :

source: Getting the posts, please wait...
fr_fr: Chargement des vidéos, veuillez patienter...

source: Load more videos
fr_fr: Charger plus de vidéos

source: Video preview
fr_fr: Miniature

source: Video title
fr_fr: Titre de la vidéo

source: Video description
fr_fr: Description de la vidéo

source: Upload date
fr_fr: Date d'upload

source: Google Youtube API settings :
fr_fr: Paramètres de l'API Google Youtube :

source: Google Youtube API key:
fr_fr: Clé API Youtube :

source: Paste here your consumer key
fr_fr: Collez ici votre consumer key

source: Approve
fr_fr: Enregistrer

source: Deny
fr_fr: Rejeter

source: You have changed the query parameters, remember to click on Save Changes to update the results.
fr_fr: Vous avez changé les paramètres de votre requête, n\'oubliez pas de cliquer sur Enregistrer les modifications pour mettre à jour les résultats.

source: There is an error with your API key, it has been rejected by Google API Service.
fr_fr: Il semble y avoir une erreur avec votre configuration (clé API Google, ID playlist ou de chaîne Youtube), veuillez vérifier ces paramètres.

source: Query type:
fr_fr: Type de requête :

source: Type your query.
fr_fr: Tapez votre requête.

source: If your query type is a playlist or a user, then you must type the relevant playlist / user ID.
fr_fr: Si votre requête correspond à une playlist ou une chaîne Youtube, vous devez renseigner l'ID de celle-ci.

source: Taxonomy term to feed:
fr_fr: Terme de taxonomie à remplir :

source: Published:
fr_fr: Publié:

source: Results are ordered by date, newest first.
fr_fr: Les résultats sont rangés par date, les plus récents en premier.

source: Your Youtube API access is not defined, go set it on the <a href="options-general.php?page=youtube-to-posts">settings page</a>.
fr_fr: Vous n'avez pas renseigné de clé d'API Youtube, renseignez-là sur <a href="options-general.php?page=youtube-to-posts">la page d'options</a>.

source: Post content format :
fr_fr: Format du contenu de l'article :

source: You can customize the way Youtube content will feed your posts with a template tag system. So:
fr_fr: Vous pouvez personnaliser la façon dont vous alimentez votre site avec des contenus Youtube :

source: Title format of your videos:
fr_fr: Format de titre des articles ajoutés :

source: Content format of your videos:
fr_fr: Format du contenu des articles ajoutés :

source: How can I get a Google API key?
fr_fr: Comment puis-je avoir une clé API Google ?

source: To use this plugin, you'll need to create a Google Youtube API key. Dealing with Google Developers Console can be a bit confusing, you need to : create a project, make the API data you need active and generate a public API key. Here's how to do that:
fr_fr: Pour utiliser ce plugin, vous devez créer une clé d'API Youtube sur la console de développeur Google. Ça parait compliqué, mais ça ne l'est pas tant que ça, il faut : créer un projet, activer l'API \"YouTube Data API v3\" et générer ensuite une clé API. Voici comment faire, pas à pas :

source: Login to Google using your Google account.
fr_fr: Connectez-vous sur Google avec votre compte Google.

source: Go to the <a target="_blank" href="https://console.developers.google.com/project">Developers Console > Projects</a>
fr_fr: Allez sur <a target="_blank" href="https://console.developers.google.com/project">la console de développeurs > Projets</a>

source: Click on "Create a project" (you'll need to give it a title and an ID)
fr_fr: Cliquez sur "Créer un projet" (il faudra lui donner un titre et un ID)

source: When your project his created, click on it on the project list
fr_fr: Lorsque votre projet est créé, cliquez dessus dans la liste des projets

source: Go to the section API and authentication > API, and search for YouTube Data API v3, and click on the button on the right to make this API active.
fr_fr: Allez dans la section API et authentification > API et rechercher Youtube Data API v3, et activez la via le bouton à droite.

source: Go to the Credentials section > Access to the public API anc click on the button "Make a key" > Server key
fr_fr: Allez dans la section Identifiants > Ajouter des identifiants > Clé API > Clé serveur

source: On the next box, you'll need to tell on which domains you allow the use of your app (e.g. 127.0.0.1, www.mydomain.com, etc).
fr_fr: Vous pouvez également renseigner des domaines sur lesquels l'utilisation de cette clé est autorisé (ex : 127.0.0.1, etc...)

source: Now it should have generated a API Key (e.g. AIzaFyD0aPCQjLFRbLnh4RKbVBlBgVCVSwjbFAg), copy-paste it on the box above.
fr_fr: En cliquant sur Créer, une popup s'ouvre avec votre clé API, vous n'avez plus qu'à la renseigner dans le champ en haut de cette page.

source: It's done, congrats :)
fr_fr: C'est fait, bien joué :)

source: %title% is the title of the Youtube video
fr_fr: %title% est le titre de la vidéo

source: %description% is the description (500 chars max - Youtube restriction) of the Youtube video
fr_fr: %description% est la description de la vidéo (500 caractères max., imposé par Youtube)

source: %embed% will display the embed code of the video
fr_fr: %embed% affichera le code embed de la vidéo

source: %thumbnail% will display the thumbnail of the video
fr_fr: %thumbnail% affiche la miniature (preview) de la vidéo

source: %query% will display the query you typed
fr_fr: %query% vous permet d'afficher la requête que vous avez tapé

source: %user% will display the uploader of the video
fr_fr: %user% affichera le nom d'utilisateur de la personne qui a uploadé la vidéo

source: %date% will display the upload date of the video
fr_fr: %date% affichera la date d'upload de la vidéo

source: Default title is just %title%
fr_fr: Par défaut, le titre correspond au titre de la vidéo (%title%)

source: e.g. Last Video of %user% - %title%
fr_fr: ex :Dernière vidéo par %user% - %title%

source: Default content is %embed%<br>%description%
fr_fr: Par défaut : %embed%<br>%description%

source: If you select a custom post type, be sure it supports Post Thumbnails.
fr_fr: Si vous sélectionnez un type de publication personnalisé, assurez-vous qu'il supporte les images à la une (Post Thumbnails).

source: Loading...
fr_fr: Chargement...

source: Video added !
fr_fr: Vidéo ajoutée !

source: Video rejected !
fr_fr: Vidéo supprimée !

source: Post status of created posts:
fr_fr: Status des articles nouvellement créés:
